; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	satellite3 - satellite
	instrument6 - instrument
	instrument7 - instrument
	image1 - mode
	spectrograph6 - mode
	infrared3 - mode
	infrared8 - mode
	image5 - mode
	spectrograph0 - mode
	thermograph7 - mode
	spectrograph4 - mode
	spectrograph2 - mode
	Star1 - direction
	Star3 - direction
	Star0 - direction
	GroundStation2 - direction
	Star4 - direction
	Phenomenon5 - direction
	Star6 - direction
	Planet7 - direction
	Planet8 - direction
	Planet9 - direction
	Planet10 - direction
	Star11 - direction
)
(:init
	(supports instrument0 spectrograph2)
	(calibration_target instrument0 Star4)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation2)
	(supports instrument1 spectrograph2)
	(supports instrument1 image1)
	(calibration_target instrument1 Star4)
	(supports instrument2 image1)
	(supports instrument2 spectrograph4)
	(calibration_target instrument2 Star4)
	(supports instrument3 infrared3)
	(calibration_target instrument3 Star0)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation2)
	(supports instrument4 image5)
	(supports instrument4 spectrograph0)
	(supports instrument4 infrared3)
	(supports instrument4 spectrograph6)
	(calibration_target instrument4 GroundStation2)
	(supports instrument5 infrared3)
	(supports instrument5 infrared8)
	(calibration_target instrument5 Star4)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star1)
	(supports instrument6 infrared3)
	(supports instrument6 spectrograph0)
	(supports instrument6 image1)
	(calibration_target instrument6 GroundStation2)
	(supports instrument7 image1)
	(supports instrument7 image5)
	(supports instrument7 thermograph7)
	(calibration_target instrument7 Star4)
	(on_board instrument6 satellite3)
	(on_board instrument7 satellite3)
	(power_avail satellite3)
	(pointing satellite3 GroundStation2)
)
(:goal (and
	(pointing satellite1 Star1)
	(have_image Phenomenon5 image1)
	(have_image Phenomenon5 infrared8)
	(have_image Phenomenon5 thermograph7)
	(have_image Star6 spectrograph6)
	(have_image Star6 spectrograph2)
	(have_image Star6 infrared3)
	(have_image Planet7 thermograph7)
	(have_image Planet7 spectrograph6)
	(have_image Planet7 infrared8)
	(have_image Planet8 infrared3)
	(have_image Planet9 image5)
	(have_image Planet9 image1)
	(have_image Planet9 spectrograph4)
	(have_image Planet10 spectrograph6)
	(have_image Planet10 infrared8)
	(have_image Planet10 spectrograph2)
	(have_image Star11 thermograph7)
	(have_image Star11 spectrograph2)
	(have_image Star11 spectrograph4)
))

)

; plan
1. (turn_to satellite3 star4 groundstation2)
   deleted: (pointing satellite3 groundstation2)
   added: (pointing satellite3 star4)
   goals met: 0 of 20
2. (switch_on instrument7 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument7)
   goals met: 0 of 20
3. (calibrate satellite3 instrument7 star4)
   added: (calibrated instrument7)
   goals met: 0 of 20
4. (turn_to satellite3 planet7 star4)
   deleted: (pointing satellite3 star4)
   added: (pointing satellite3 planet7)
   goals met: 0 of 20
5. (take_image satellite3 planet7 instrument7 thermograph7)
   added: (have_image planet7 thermograph7)
   goals met: 1 of 20
6. (turn_to satellite3 phenomenon5 planet7)
   deleted: (pointing satellite3 planet7)
   added: (pointing satellite3 phenomenon5)
   goals met: 1 of 20
7. (turn_to satellite2 groundstation2 star1)
   deleted: (pointing satellite2 star1)
   added: (pointing satellite2 groundstation2)
   goals met: 1 of 20
8. (turn_to satellite1 star4 groundstation2)
   deleted: (pointing satellite1 groundstation2)
   added: (pointing satellite1 star4)
   goals met: 1 of 20
9. (turn_to satellite0 star4 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 star4)
   goals met: 1 of 20
10. (take_image satellite3 phenomenon5 instrument7 thermograph7)
   added: (have_image phenomenon5 thermograph7)
   goals met: 2 of 20
11. (take_image satellite3 phenomenon5 instrument7 image1)
   added: (have_image phenomenon5 image1)
   goals met: 3 of 20
12. (switch_on instrument4 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument4)
   goals met: 3 of 20
13. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 3 of 20
14. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 3 of 20
15. (calibrate satellite2 instrument4 groundstation2)
   added: (calibrated instrument4)
   goals met: 3 of 20
16. (calibrate satellite1 instrument2 star4)
   added: (calibrated instrument2)
   goals met: 3 of 20
17. (calibrate satellite0 instrument0 star4)
   added: (calibrated instrument0)
   goals met: 3 of 20
18. (turn_to satellite0 planet10 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 planet10)
   goals met: 3 of 20
19. (take_image satellite0 planet10 instrument0 spectrograph2)
   added: (have_image planet10 spectrograph2)
   goals met: 4 of 20
20. (turn_to satellite0 star11 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 star11)
   goals met: 4 of 20
21. (take_image satellite0 star11 instrument0 spectrograph2)
   added: (have_image star11 spectrograph2)
   goals met: 5 of 20
22. (turn_to satellite0 star6 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 star6)
   goals met: 5 of 20
23. (take_image satellite0 star6 instrument0 spectrograph2)
   added: (have_image star6 spectrograph2)
   goals met: 6 of 20
24. (turn_to satellite1 planet9 star4)
   deleted: (pointing satellite1 star4)
   added: (pointing satellite1 planet9)
   goals met: 6 of 20
25. (take_image satellite1 planet9 instrument2 image1)
   added: (have_image planet9 image1)
   goals met: 7 of 20
26. (take_image satellite1 planet9 instrument2 spectrograph4)
   added: (have_image planet9 spectrograph4)
   goals met: 8 of 20
27. (turn_to satellite1 star11 planet9)
   deleted: (pointing satellite1 planet9)
   added: (pointing satellite1 star11)
   goals met: 8 of 20
28. (take_image satellite1 star11 instrument2 spectrograph4)
   added: (have_image star11 spectrograph4)
   goals met: 9 of 20
29. (turn_to satellite1 star1 star11)
   deleted: (pointing satellite1 star11)
   added: (pointing satellite1 star1)
   goals met: 10 of 20
30. (turn_to satellite2 planet10 groundstation2)
   deleted: (pointing satellite2 groundstation2)
   added: (pointing satellite2 planet10)
   goals met: 10 of 20
31. (take_image satellite2 planet10 instrument4 spectrograph6)
   added: (have_image planet10 spectrograph6)
   goals met: 11 of 20
32. (turn_to satellite2 planet7 planet10)
   deleted: (pointing satellite2 planet10)
   added: (pointing satellite2 planet7)
   goals met: 11 of 20
33. (take_image satellite2 planet7 instrument4 spectrograph6)
   added: (have_image planet7 spectrograph6)
   goals met: 12 of 20
34. (turn_to satellite2 planet8 planet7)
   deleted: (pointing satellite2 planet7)
   added: (pointing satellite2 planet8)
   goals met: 12 of 20
35. (take_image satellite2 planet8 instrument4 infrared3)
   added: (have_image planet8 infrared3)
   goals met: 13 of 20
36. (turn_to satellite2 planet9 planet8)
   deleted: (pointing satellite2 planet8)
   added: (pointing satellite2 planet9)
   goals met: 13 of 20
37. (take_image satellite2 planet9 instrument4 image5)
   added: (have_image planet9 image5)
   goals met: 14 of 20
38. (turn_to satellite2 star6 planet9)
   deleted: (pointing satellite2 planet9)
   added: (pointing satellite2 star6)
   goals met: 14 of 20
39. (take_image satellite2 star6 instrument4 infrared3)
   added: (have_image star6 infrared3)
   goals met: 15 of 20
40. (take_image satellite2 star6 instrument4 spectrograph6)
   added: (have_image star6 spectrograph6)
   goals met: 16 of 20
41. (switch_off instrument4 satellite2)
   deleted: (power_on instrument4)
   added: (power_avail satellite2)
   goals met: 16 of 20
42. (switch_on instrument5 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument5)
   goals met: 16 of 20
43. (turn_to satellite2 star4 star6)
   deleted: (pointing satellite2 star6)
   added: (pointing satellite2 star4)
   goals met: 16 of 20
44. (calibrate satellite2 instrument5 star4)
   added: (calibrated instrument5)
   goals met: 16 of 20
45. (turn_to satellite2 phenomenon5 star4)
   deleted: (pointing satellite2 star4)
   added: (pointing satellite2 phenomenon5)
   goals met: 16 of 20
46. (take_image satellite2 phenomenon5 instrument5 infrared8)
   added: (have_image phenomenon5 infrared8)
   goals met: 17 of 20
47. (turn_to satellite2 planet10 phenomenon5)
   deleted: (pointing satellite2 phenomenon5)
   added: (pointing satellite2 planet10)
   goals met: 17 of 20
48. (take_image satellite2 planet10 instrument5 infrared8)
   added: (have_image planet10 infrared8)
   goals met: 18 of 20
49. (turn_to satellite2 planet7 planet10)
   deleted: (pointing satellite2 planet10)
   added: (pointing satellite2 planet7)
   goals met: 18 of 20
50. (take_image satellite2 planet7 instrument5 infrared8)
   added: (have_image planet7 infrared8)
   goals met: 19 of 20
51. (turn_to satellite3 star11 phenomenon5)
   deleted: (pointing satellite3 phenomenon5)
   added: (pointing satellite3 star11)
   goals met: 19 of 20
52. (take_image satellite3 star11 instrument7 thermograph7)
   added: (have_image star11 thermograph7)
   goals met: 20 of 20
